In [11]:
import numpy as np 
import pandas as pd

In [18]:

df = pd.read_csv('spam.csv', encoding='latin1')

In [15]:
df.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
4658,ham,I cant pick the phone right now. Pls send a me...,NaN,NaN,NaN
2607,ham,:-) yeah! Lol. Luckily i didn't have a starrin...,NaN,NaN,NaN
2367,ham,V nice! Off 2 sheffield tom 2 air my opinions ...,NaN,NaN,NaN
4131,ham,Hi baby ive just got back from work and i was ...,NaN,NaN,NaN
2931,ham,Only 2% students solved this CAT question in '...,NaN,NaN,NaN

In [20]:
df.shape

(5572, 5)

In [22]:
# Data cleaning 
# EDA 
# Text Preprocessing 
# Model Building 
# Evaluation 
# Improvement 
# Website 
# Deployment

## Data Cleaning

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [24]:
#drop last 3 cols

In [25]:
df.drop(columns = ['Unnamed: 2' , 'Unnamed: 3' , 'Unnamed: 4'], inplace = True)

In [27]:
df.sample(5)

        v1                                                 v2
1297   ham             K so am I, how much for an 8th? Fifty?
1610   ham                   I'll probably be around mu a lot
4476   ham  Oh :-)only 4 outside players allowed to play know
737   spam  Hi. Customer Loyalty Offer:The NEW Nokia6650 M...
2898   ham  Aight, I should be there by 8 at the latest, p...

In [28]:
#renaming the columns

In [29]:
df.rename(columns = {'v1' : 'target' , 'v2' : 'text'}, inplace = True)

In [30]:
df.sample(5)

     target                                               text
4047    ham  Lol or I could just starve and lose a pound by...
1938    ham  Excellent! Are you ready to moan and scream in...
1376    ham           Auntie huai juan never pick up her phone
3533    ham                         Good evening! How are you?
4552    ham  Sun ah... Thk mayb can if dun have anythin on....

In [32]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [34]:
df['target'] = encoder.fit_transform(df['target'])

In [35]:
df.head()

   target                                               text
0       0  Go until jurong point, crazy.. Available only ...
1       0                      Ok lar... Joking wif u oni...
2       1  Free entry in 2 a wkly comp to win FA Cup fina...
3       0  U dun say so early hor... U c already then say...
4       0  Nah I don't think he goes to usf, he lives aro...

In [36]:
df.isnull().sum()

target    0
text      0
dtype: int64

In [37]:
#check for duplicate values 
df.duplicated().sum()

np.int64(403)

In [40]:
#remove duplicates
df = df.drop_duplicates(keep = 'first')